using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using Exiled.API.Interfaces;
namespace MainRPCorePlugin
{
    public class Config : IConfig
    {
        public bool IsEnabled { get; set; } = true;
        public bool Debug { get; set; } = true;

        [Description("Here Is CustomNameModuleSettings")]
        public bool CustomNameModule { get;set; } = true;
        public List<string> HumanNames { get; set; } = new List<string>
        {
            "Александр", "Борис", "Владимир", "Григорий", "Дмитрий",
            "Евгений", "Иван", "Кирилл", "Михаил", "Николай",
            "Олег", "Павел", "Роман", "Сергей", "Тимофей",
            "Ульян", "Федор", "Харитон", "Цезарь", "Шарль",
            "Эдуард", "Юрий", "Ярослав", "Захар", "Анатолий",
            "Богдан", "Валентин", "Глеб", "Даниил", "Егор",
            "Жорж", "Зенон", "Илья", "Константин", "Лев",
            "Максим", "Никита", "Остап", "Петр", "Кузьма",
            "Руслан", "Семен", "Тарас", "Устин", "Валерий",
            "Христофор", "Чеслав", "Шамиль", "Эльдар", "Юлиан",
            "Ян", "Артем", "Богдан", "Вадим", "Геннадий",
            "Денис", "Ефим", "Заур", "Игорь", "Клим",
            "Леонид", "Марк", "Нестор", "Онисим", "Платон",
            "Родион", "Савелий", "Тихон", "Умар", "Всеволод",
            "Исидор", "Карен", "Лазарь", "Мирон", "Назар",
            "Омар", "Пётр", "Руфин", "Святослав", "Тигран",
            "Улугбек", "Франц", "Хаким", "Цезарь", "Чингис",
            "Шамиль", "Эльдар", "Юрий", "Ян"
        };
        public List<string> PozivNieMTF { get; set; } = new List<string>
        {
     "Альфа","Браво","Джульета",
     "Дельта","Эхо","Индия","Виски","Гольф","Новембер","Майк","Лима","Кило",
     "Икс-рей","Оскар","Квебек","Сиерра","Танго","Уни","Вик"

 };

        public List<string> PozivNieSB { get; set; } = new List<string>
 {
    "Зорро","Искра","Нефть","Омега","Пегас","Рубин","Сталкер","Тайфун","Убийца","Хищник",
    "Центурион","Шторм","Эльбрус","Юпитер","Агронавт","Беркут","Вулкан","Гранит","Змей","Инспектор",
    "Кондор","Лазер","Меркурий", "Острог"

 };

        public List<string> PozivNieHAOS { get; set; } = new List<string>
 {
    "Ястреб","Гроза","Титан","Легионер","Вихрь","Череп","Феникс","Молния","Железный Орел",
    "Сокол","Гром","Аваланш","Разрушитель","Тигр","Кобра","Черный Лебедь","Стальной Клинок","Скорпион",
     "Огненый дракон"

 };

        public List<string> DoctorName { get; set; } = new List<string>
 {
     "Родион","Алекс","Онисим","Цезарь","Устин","Валентин","Шарль",
     "Черчиль","Усов","Усынин","Пивоваров","Окопов","Франклин",
     "Измаил","Вектор","Квантум","Никс","Мюллер","Старк","Рид",
     "Ричард","Вождаев","Морозов","Зайцев","Новиков","Китов","Эфир",
     "Дюма","Мертвецов","Нетеро","Квантов","Генов",
     "Александр", "Борис", "Владимир", "Григорий", "Дмитрий","Квазаров"

 };

        [Description("Here Is Scp079RecontModule")]
        public bool Scp079ReconModule { get; set; } = true;
    }
}
